{
  "menu": {
    "menus": [
      {
        "name": "About",
        "link": "/me"
      },
      {
        "name": "Work",
        "link": "/work"
      },
      {
        "name": "School",
        "link": "/scholarship"
      },
      {
        "name": "Projects",
        "link": "/projects"
      },
      {
        "name": "Contact",
        "link": "/contact"
      }
    ]
  },
  "me": {
    "values": {
      "title": "My values",
      "list": [
        {
          "title": "Passionate",
          "description": "Do what you love and love what you do would define how I conceive work."
        },
        {
          "title": "Logical",
          "description": "Logic is what I like, I love problems, challenges, That's my cuppa!"
        },
        {
          "title": "Honest",
          "description": "I consider myself as a true person, and like to tell the truth."
        },
        {
          "title": "Creative",
          "description": "Always after the latest ideas, and trying to find new ones."
        },
        {
          "title": "Fun",
          "description": "Life would be sad with no jokes and no good stories."
        },
        {
          "title": "Loyal",
          "description": "Respect the people and the projects worth fighting for."
        }
      ]
    },
    "interests": {
      "title": "What I do like",
      "list": [
        {
          "title": "Friends",
          "icon":"group",
          "description": "The ones that are always ready for some great time together, those are the best ones!"
        },
        {
          "title": "Travel",
          "icon":"flight_takeoff",
          "description": "I stopped counting the journeys a while ago, and usually travel to Europe or Brazil."
        },
        {
          "title": "Games",
          "icon":"videogame_asset",
          "description": "More of a board / puzzle / brain game tough, even if I won't refuse something that empties my mind."
        },
        {
          "title": "The usual",
          "icon":"more_horiz",
          "description": "Sports, making food, eating food, listening to music, speaking foreign languages, drinking good wines, fuit juices or beers."
        }
      ]
    }
  },
  "work": {
    "title":"Work",
    "pitch":"Let's speak a bit about what I do for a living.",
    "experiences": [
        {
        "name": "Cordant Group",
        "fromTo": "Nov. 2015 - Nowadays",
        "description": "Cordant Group is one of the top recruitment companies in UK. The main domains covered by the company are managed services (for clients as Tesco, Amazon), security, facility management, IT staff recruitment and other. The company employs about 3 000 people in its core, and 50 000 overall.",
        "projects": [
            {
            "name": "Cordant Connect",
            "fromTo": "Sep. 2016 - Nowadays",
            "quickDescription": "Collection of micro services developped with cutting edge technologies, to ease the journey of candidates in the recruitment process.",
            "bullets": [
              "Cutting edge technologies",
              "Full stack"
            ],
            "achievements": [
              "Developped and deployed various fast growing apps with huge ROI for the buiness",
              "Improved the coding and deployment process",
              "Took the lead of a team of developpers"
            ],
            "longDescriptions": [
              "Cordant Connect is a set of applications developped since late 2016 as microservices, to numerize and automate the work of Cordant Group employees, and to ease the journey of the candidates. It starts from the first contact the candidates have with the company (a call, an appointment in a branch), and goes all along the colleague's life in the company. The first applications have been a success and quickly acepted by both branch staff and candidates.",
              "From a technical point of view, the project started as a PoC (front end developped in HTML + jQuery / Google Spreadsheet database), and has now a fully grown technical stack, taking advantage of the latest technologies as for instance Angular 4, AWS Lambda, Serverless, PostgresSQL Database, AWS DynamoDB (NoSQL database)..."
            ]
          },
          {
            "name": "Spirit and Legacy",
            "fromTo": "Nov. 2015 - Mar. 2017",
            "quickDescription": "Support and maintenance of the legacy systems, automation of some processes, and development of a new system for workers management.",
            "bullets": [
              "Wide spectrum of apps",
              "Automation"
            ],
            "achievements": [
              "Understanding the recruitment business through the user support and the applications",
              "Catched up quickly on a project using proprietary language and complex algorithms and structure",
              "Automated account creation for an application"
            ],
            "longDescriptions": [
              "My first assignment at Cordant Group was to work on the legacy systems that are still woring nowadays, as well as working on a new project that was being developped. The legacy systems cover a large spectrum of Microsoft applications, as for example C# applications, ASP websites, SSIS, SSRS, SQL Server databases, as well as off the shelf products, as for instance RoleCall.",
              "My second assignment was a project called Spirit, developped on ISIS Papyrus's proprietary platform, to create in the first place an application to onboard candidates, and in the second place a candidate management system."
            ]
          }
        ],
        "technologies": [{
          "imageLink":"assets/images/angular.png",
          "link": "https://angular.io",
          "tooltip": "Angular"
        },{
          "imageLink":"assets/images/google.png",
          "link": "https://developers.google.com/",
          "tooltip": "Google"
        },
        {
          "imageLink":"assets/images/aws.png",
          "link": "https://aws.amazon.com/fr/free/",
          "tooltip": "AWS Services"
        },
        {
          "imageLink":"https://s3-us-west-2.amazonaws.com/assets.site.serverless.com/logos/serverless-logo.svg",
          "link": "https://serverless.com/",
          "tooltip": "Serverless"
        },
        {
          "imageLink":"assets/images/postgres.png",
          "link": "https://www.postgresql.org/",
          "tooltip": "Postgres"
        },
        {
          "imageLink":"assets/images/npm.png",
          "link": "https://www.npmjs.com/",
          "tooltip": "npm"
        },
        {
          "imageLink":"assets/images/git.png",
          "link": "https://github.com/",
          "tooltip": "GitHub"
        }
      ]
    },
    {
      "name": "CGI",
      "fromTo": "Apr. 2011 - Sep 2015",
      "description": "CGI is an information technology and business process outsourcing company, strong of about 70 000 IT professionals. I worked in this company for about 4 years and a half, first as an intern, and then as an analyst developper. I worked for Dalkia (one of the main accounts for CGI Grenoble), a client managing heating and air conditioning systems in France and Italy.",
      "projects": [{
        "name": "Sigma Liss",
        "fromTo": "Mar. 2012 - Sep. 2015",
        "quickDescription": "Field journey scheduler.",
        "bullets": [
          "Monitoring automation",
          "User satisfaction"
        ],
        "achievements": [
          "Improved the data interface of the application from 70% to 99.5%",
          "Develpped several monitoring and automation tools for support",
          "Deployed the application to about 30 users"
        ],
        "longDescriptions": [
          "This project started some years before I joined the company, and wasn't quite used until the team changed. It became one of the main projects for Dalkia, as the cost reduction policy pointed out that the time spend on the field wasn't optimized. The idea for our team was to implement a part of the ARM solution developped by CGI U.S. and adapt it to Dalkia's context. The main challenge being the communication with Dalkia's other applications, the interface was a really critical subject, and was monitored hourly, with tools we developped inhouse. From the start of our intervention on the project to the end of my work on it, the interface fiability moved from 70% to 99%",
          "From a technology point of view, the software was based on C++ code we couldn't act on, comunicating with an Oracle 10 database. The monitoring application was first based on Excel VBA macros, and has been moved slowly to a HTML / jQuery / Bootstrap front end, plugged to an Oracle Database."
        ]
      },
      {
        "name": "Energy",
        "fromTo": "Apr. 2011 - Mar. 2017",
        "quickDescription": "Heating and air conditioning systems management.",
        "bullets": [
          "Complex system",
          "Critical app"
        ],
        "achievements": [
          "Deployed new UI components and refreshed the design of the app",
          "Earned business trust on complex subjects",
          "Got to speed on an old and complicated application"
        ],
        "longDescriptions": [
          "This project was a monster web application, managing the consumptions and budgeting of the heating and air conditioning systems Dalkia was working on. It had at the time about 250 users, with 50 working live. It was one of Dalkia's main applications, as holder of the information used for the invoicing process. It was though comunicating with about 20 other applications, and had about 25 Oracle batches running at night, and a 24 hours budget closure batch day at the end of the year.",
          "Concerning technologies, it was a complicated super layered ASP.Net application, that we moved from .Net 2.0 to .Net 4.0, comunicating with an Oracle 10 Database. It used a Microsoft Silverlight component that I developped during my internship, to edit the technical schema of the systems."
        ]
      }],
      "technologies" :[{
        "imageLink":"assets/images/asp.png",
        "link": "https://www.asp.net/",
        "tooltip":"ASP.Net"
      },
      {
        "imageLink":"assets/images/jquery.png",
        "link": "https://jquery.com/",
        "tooltip":"jQuery"
      },
      {
        "imageLink":"assets/images/bootstrap.png",
        "link": "http://getbootstrap.com/",
        "tooltip":"Bootstrap"
      },
      {
        "imageLink":"assets/images/oracle.png",
        "link": "https://www.oracle.com/index.html",
        "tooltip":"Oracle"
      },
      {
        "imageLink":"assets/images/microsoft.png",
        "link": "https://www.microsoft.com/",
        "tooltip":"Microsoft"
      }]
    }]
  },
  "projects": {
    "title":"Projects",
    "pitch":"We all start small, and end up as far as our life let us go to. Those projects are not my first ones, not my last ones, but they are what made me like what I do.",
    "list": [
      {
        "name": "3D images - Webcam headtracker",
        "link": "headtracker",
        "linkTest": "demo",
        "pitch": "What if a plane surface gave you the impression of 3D, with no glasses or VR headset? That is the idea of this project. Using ThreeJS and headtrackr, I managed to reproduce a '3D effect' on pictures I have taken and pre-processed. It has just been adapted to work with Angular.",
        "explaination": [
          "The idea is simple but first of all, you have to have pictures. I took mine in Chiswick house and gardens park, London, UK, or during the Coupe Icare, Grenoble, France.",
          "I then identified the pictures that were to be used, and edited them, so that they contained only graphical information relevant for the layer I wanted them to represent.",
          "Then, ThreeJS and headtrackr provided respectively the 3D environment and the head location necessary to do the calculation to render the pictures.",
          "The only remaining challenge was to play with depth and the virtual head to have this effect."
        ],
        "beforeTesting": [
          "This experience has been designed for desktops with webcam only, so please do not expect it to work properly on tablet or smartphone.",
          "There is a defined set of scenes, feel free to press the left and right arrows of your keyboard to discover.",
          "The next page will ask for your authorization to use the camera, it is for head tracking purpose only, no worries.",
          "Please try to use as much light as you can on your face, this ease the process of face detection.",
          "The video stream might not stop after you come back from the next screen, I am working on it, please reload the page if any issue.",
          "It might be a little laggy, yet again, I was proud and happy with the result, I hope you will like it."
        ],
        "links": [
          {
            "name": "three js",
            "link": "https://threejs.org/"
          },
          {
            "name": "headtrackr",
            "link": "https://github.com/auduno/headtrackr"
          }
        ]
      },
      {
        "name": "Ulam Spiral",
        "link": "prime",
        "linkTest": "demo",
        "pitch": "Have you ever felt bored during some meetings? Well, Stanislaw Ulam did, got a piece of paper, and drew a spiral of the positive integers (Yeah, no Facebook in 1963). After drawing a few hundred points, he noticed managed to obtain a pretty graphical depiction of prime numbers, that offered a map of the density of prime numbers.",
        "explaination": [
          "During some research work, I had a closer look into prime numbers, and a closer one to their representation: The Ulam Spiral.",
          "The idea of this spiral is to represent all positive integers, in a spiral, and highlight the prime integers only. This work has done no major breakthrough on the comprehension of the prime numbers, but definitely gives an intriguing representation of the density of those numbers."
        ],
        "beforeTesting": [
          "This experience has been designed for desktops, so please do not expect it to work properly on tablet or smartphone.",
          "You can zoom in/out with the mouse's wheel, and rotate draging your mouse on the screen."
        ],
        "links": [
          {
            "name": "three js",
            "link": "https://threejs.org/"
          },
          {
            "name": "Wikipedia - Ulam Spiral",
            "link": "https://en.wikipedia.org/wiki/Ulam_spiral"
          }
        ]
      }
    ]
  },
  "school": {
    "title":"Scholarship",
    "pitch":"You'll find here the description of the years learning about what I am now doing.",
    "experiences": [
      {
        "name": "Master degree in Virtual Reality (Master EVA)",
        "place": "Arts & Métiers ParisTech (Chalon-sur-Saône)",
        "fromTo": "Sep. 2010 - Apr. 2011",
        "descriptions": ["EVA stands for Espaces Virtuels Avancés, which means Advanced Virtual Spaces. I learned there about AR and VR technologies, the CGI pipeline and theory concerning virtual worlds."],
        "link": "http://mti3d.artsetmetiers.fr/"
      },
      {
        "name": "General engineering degree",
        "place": "Arts & Métiers ParisTech (Cluny and Paris)",
        "fromTo": "Sep. 2007 - Jun. 2010",
        "descriptions": [
          "Arts & Métiers ParisTech School is one of the schools from the ParisTech network, grouping some of the best schools in France. This school provides lessons from mechanical engineering to project management, and has a huge alumni society.",
          "This is where I discovered computer science and my abilities to understand and adapt complicated contexts."
        ],
        "link": "https://artsetmetiers.fr/"
      }
    ]
  },
  "contact": {
    "title":"Get in touch!",
    "pitch":"I like to hear about new challenges. Don't hesitate to contact me."
  }
}
